<template>
  <main class="main--full-window">
    <section class="section-mb">
      <ContainerContent class="container section-mb">
        <h1>H1Политика конфиденциальности</h1>
        <h2>H2 заголовок</h2>
        <h3>H3 заголовок</h3>
        <h4>H4 заголовок</h4>
        <h5>H5 заголовок</h5>
        <p>
          Оборудование для промышленной маркировки предназначено для нанесения
          идентификационных данных и информации о товаре в условиях
          производства. Современные каплеструйные принтеры позволяют наносить
          яркие стойкие изображения бесконтактным методом на любые типы
          поверхностей. Они легко встраиваются в технологический процесс, просты
          и удобны в эксплуатации. Альтернатива каплеструйной маркировке –
          лазерная маркировка изделий, позволяющая наносить долговременные,
          практически нестираемые изображения. Лазерный маркиратор не столь
          универсален в плане материала поверхности, зато более экономичен и
          гибок в настройке. Этикетка позволяет не только предоставляет
          покупателю информацию о товаре, но и является частью его рекламного
          образа. Любое серийное производство требует быстрого нанесения
          качественных этикеток. Для решения этих задач мы поставляем
          автоматические аппликаторы самоклеящихся этикеток и термотрансферные
          принтеры. В функции современных этикетировочных комплексов входит
          предварительная печать дополнительной информации: даты, серии,
          штрих-кода.
        </p>
        <ul>
          <li>Печать со скоростью до 8,41 м/сек</li>
          <li>Размер символов от 1,1 до 15,0 мм</li>
          <li>Размер символов от 1,1 до 15,0 мм</li>
          <li>Печать на расстоянии до 40 мм от объекта</li>
        </ul>
        <ol>
          <li>Печать со скоростью до 8,41 м/сек</li>
          <li>Размер символов от 1,1 до 15,0 мм</li>
          <li>Размер символов от 1,1 до 15,0 мм</li>
          <li>Печать на расстоянии до 40 мм от объекта</li>
        </ol>
        <p>
          Оборудование для промышленной маркировки предназначено для нанесения
          идентификационных данных и информации о товаре в условиях
          производства. Современные каплеструйные принтеры позволяют наносить
          яркие стойкие изображения бесконтактным методом на любые типы
          поверхностей. Они легко встраиваются в технологический процесс, просты
          и удобны в эксплуатации. Альтернатива каплеструйной маркировке –
          лазерная маркировка изделий, позволяющая наносить долговременные,
          практически нестираемые изображения. Лазерный маркиратор не столь
          универсален в плане материала поверхности, зато более экономичен и
          гибок в настройке. Этикетка позволяет не только предоставляет
          покупателю информацию о товаре, но и является частью его рекламного
          образа. Любое серийное производство требует быстрого нанесения
          качественных этикеток. Для решения этих задач мы поставляем
          автоматические аппликаторы самоклеящихся этикеток и термотрансферные
          принтеры. В функции современных этикетировочных комплексов входит
          предварительная печать дополнительной информации: даты, серии,
          штрих-кода.
        </p>
        <table ref="table">
          <thead>
            <tr>
              <th>Модель</th>
              <th>Мощность</th>
              <th>Стандартная</th>
              <th>Стандартная</th>
              <th>Стандартная</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>SL101</td>
              <td>10</td>
              <td>0,27</td>
              <td>44×44</td>
              <td>44×44</td>
            </tr>
            <tr>
              <td>SL101</td>
              <td>10</td>
              <td>0,27</td>
              <td>44×44</td>
              <td>44×44</td>
            </tr>
            <tr>
              <td>SL101</td>
              <td>10</td>
              <td>0,27</td>
              <td>44×44</td>
              <td>44×44</td>
            </tr>
            <tr>
              <td>SL101</td>
              <td>10</td>
              <td>0,27</td>
              <td>44×44</td>
              <td>44×44</td>
            </tr>
          </tbody>
        </table>
        <h2>Изображение в тексте</h2>
        <p>
          Оборудование для промышленной маркировки предназначено для нанесения
          идентификационных данных и информации о товаре в условиях
          производства. Современные каплеструйные принтеры позволяют наносить
          яркие стойкие изображения бесконтактным методом на любые типы
          поверхностей.
        </p>
        <img
          src="/images/example-1.jpg"
          style="width: 527px"
          class="align-left"
          alt=""
        >
        <p>
          Оборудование для промышленной маркировки предназначено для нанесения
          идентификационных данных и информации о товаре в условиях
          производства. Современные каплеструйные принтеры позволяют наносить
          яркие стойкие изображения бесконтактным методом на любые типы
          поверхностей.
        </p>
        <p>
          Они легко встраиваются в технологический процесс, просты и удобны в
          эксплуатации. Альтернатива каплеструйной маркировке –
          <a href="">лазерная маркировка</a> изделий, позволяющая наносить
          долговременные, практически нестираемые изображения. Лазерный
          маркиратор не столь универсален в плане материала поверхности, зато
          более экономичен и гибок в настройке. Этикетка позволяет не только
          предоставляет покупателю информацию о товаре, но и является частью его
          рекламного образа. Любое серийное производство требует быстрого
          нанесения качественных этикеток. Для решения этих задач мы поставляем
          автоматические аппликаторы самоклеящихся этикеток и термотрансферные
          принтеры. В функции современных этикетировочных комплексов входит
          предварительная печать дополнительной информации: даты, серии,
          штрих-кода.ктически нестираемые изображения. Лазерный маркиратор не
          столь универсален в плане материала поверхности, зато более экономичен
          и гибок в настройке. Этикетка позволяет не только предоставляет
          покупателю информацию о товаре, но и является частью его рекламного
          образа. Любое серийное производство требует быстрого нанесения
          качественных этикеток. Для решения этих задач мы поставляем
          автоматические аппликаторы самоклеящихся этикеток и термотрансферные
          принтеры. В функции
        </p>
        <img
          src="/images/example-1.jpg"
          style="width: 336px"
          class="align-right"
          alt=""
        >
        <p>
          Оборудование для промышленной маркировки предназначено для нанесения
          идентификационных данных и информации о товаре в условиях
          производства. Современные каплеструйные принтеры позволяют наносить
          яркие стойкие изображения бесконтактным методом на любые типы
          поверхностей.
        </p>
        <p>
          Они легко встраиваются в технологический процесс, просты и удобны в
          эксплуатации. Альтернатива каплеструйной маркировке – лазерная
          маркировка изделий, позволяющая наносить долговременные, практически
          нестираемые изображения. Лазерный маркиратор не столь универсален в
          плане материала поверхности, зато более экономичен и гибок в
          настройке. Этикетка позволяет не только предоставляет покупателю
          информацию о товаре, но и является частью его рекламного образа. Любое
          серийное производство требует быстрого нанесения качественных
          этикеток. Для решения этих задач мы поставляем автоматические
          аппликаторы самоклеящихся этикеток и термотрансферные принтеры. В
          функции современных этикетировочных комплексов входит предварительная
          печать дополнительной информации: даты, серии, штрих-кода.
          Оборудование для промышленной маркировки предназначено для нанесения
          идентификационных данных и информации о товаре в условиях
          производства. Современные каплеструйные принтеры позволяют наносить
          яркие стойкие изображения бесконтактным методом на любые типы
          поверхностей.
        </p>
        <p>
          Они легко встраиваются в технологический процесс, просты и удобны в
          эксплуатации. Альтернатива каплеструйной маркировке – лазерная
          маркировка изделий, позволяющая наносить долговременные, практически
          нестираемые изображения. Лазерный маркиратор не столь универсален в
          плане материала поверхности, зато более экономичен и гибок в
          настройке. Этикетка позволяет не только предоставляет покупателю
          информацию о товаре, но и является частью его рекламного образа. Любое
          серийное производство требует быстрого нанесения качественных
          этикеток. Для решения этих задач мы поставляем автоматические
          аппликаторы самоклеящихся этикеток и термотрансферные принтеры. В
          функции современных этикетировочных комплексов входит предварительная
          печать дополнительной информации: даты, серии, штрих-кода.
        </p>
      </ContainerContent>
      <div class="container">
        <Slider :slides="slides" :is-local-images="true"/>
      </div>
    </section>
  </main>
</template>

<script setup>
const slides = [
  "/images/example-1.jpg",
  "/images/example-2.jpg",
  "/images/example-3.jpg",
  "/images/example-4.jpg",
  "/images/example-5.jpg",
];
const device = useDevice();

const table = ref(null);

onMounted(() => {
  if (device.isMobileOrTablet) {
    const tableWrap = document.createElement("div");
    tableWrap.classList.add("table-wrap");
    table.value.parentNode.insertBefore(tableWrap, table.value);
    tableWrap.appendChild(table.value);
  }
  console.log("hehe");
});
</script>

<style lang="scss"></style>
