<template>
    <section class="content-page">
        <div class="container container--xl">
            <div class="content content-page__content">
                <h1>H1Политика конфиденциальности</h1>
                <h2>H2 заголовок</h2>
                <h3>H3 заголовок</h3>
                <h4>H4 заголовок</h4>
                <h5>H5 заголовок</h5>
                <p>Оборудование для промышленной маркировки предназначено для нанесения идентификационных данных и
                    информации о
                    товаре в условиях производства. Современные каплеструйные принтеры позволяют наносить яркие стойкие
                    изображения
                    бесконтактным методом на любые типы поверхностей. Они легко встраиваются в технологический процесс,
                    просты и
                    удобны в эксплуатации. Альтернатива каплеструйной маркировке – лазерная маркировка изделий,
                    позволяющая
                    наносить
                    долговременные, практически нестираемые изображения. Лазерный маркиратор не столь универсален в
                    плане
                    материала
                    поверхности, зато более экономичен и гибок в настройке. Этикетка позволяет не только предоставляет
                    покупателю
                    информацию о товаре, но и является частью его рекламного образа. Любое серийное производство требует
                    быстрого
                    нанесения качественных этикеток. Для решения этих задач мы поставляем автоматические аппликаторы
                    самоклеящихся
                    этикеток и термотрансферные принтеры. В функции современных этикетировочных комплексов входит
                    предварительная
                    печать дополнительной информации: даты, серии, штрих-кода.</p>
                <ul>
                    <li>Печать со скоростью до 8,41 м/сек</li>
                    <li>Размер символов от 1,1 до 15,0 мм</li>
                    <li>Размер символов от 1,1 до 15,0 мм</li>
                    <li>Печать на расстоянии до 40 мм от объекта</li>
                </ul>
                <ol>
                    <li>Печать со скоростью до 8,41 м/сек</li>
                    <li>Размер символов от 1,1 до 15,0 мм</li>
                    <li>Размер символов от 1,1 до 15,0 мм</li>
                    <li>Печать на расстоянии до 40 мм от объекта</li>
                </ol>
                <p>Оборудование для промышленной маркировки предназначено для нанесения идентификационных данных и
                    информации о
                    товаре в условиях производства. Современные каплеструйные принтеры позволяют наносить яркие стойкие
                    изображения
                    бесконтактным методом на любые типы поверхностей. Они легко встраиваются в технологический процесс,
                    просты и
                    удобны в эксплуатации. Альтернатива каплеструйной маркировке – лазерная маркировка изделий,
                    позволяющая
                    наносить
                    долговременные, практически нестираемые изображения. Лазерный маркиратор не столь универсален в
                    плане
                    материала
                    поверхности, зато более экономичен и гибок в настройке. Этикетка позволяет не только предоставляет
                    покупателю
                    информацию о товаре, но и является частью его рекламного образа. Любое серийное производство требует
                    быстрого
                    нанесения качественных этикеток. Для решения этих задач мы поставляем автоматические аппликаторы
                    самоклеящихся
                    этикеток и термотрансферные принтеры. В функции современных этикетировочных комплексов входит
                    предварительная
                    печать дополнительной информации: даты, серии, штрих-кода.</p>
                <table ref="table">
                    <thead>
                        <tr>
                            <th>Модель</th>
                            <th>Мощность</th>
                            <th>Стандартная</th>
                            <th>Стандартная</th>
                            <th>Стандартная </th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td>SL101</td>
                            <td>10</td>
                            <td>0,27</td>
                            <td>44×44</td>
                            <td>44×44</td>
                        </tr>
                        <tr>
                            <td>SL101</td>
                            <td>10</td>
                            <td>0,27</td>
                            <td>44×44</td>
                            <td>44×44</td>
                        </tr>
                        <tr>
                            <td>SL101</td>
                            <td>10</td>
                            <td>0,27</td>
                            <td>44×44</td>
                            <td>44×44</td>
                        </tr>
                        <tr>
                            <td>SL101</td>
                            <td>10</td>
                            <td>0,27</td>
                            <td>44×44</td>
                            <td>44×44</td>
                        </tr>
                    </tbody>
                </table>
                <h2>Изображение в тексте</h2>
                <p>Оборудование для промышленной маркировки предназначено для нанесения идентификационных данных и
                    информации о
                    товаре в условиях производства. Современные каплеструйные принтеры позволяют наносить яркие стойкие
                    изображения
                    бесконтактным методом на любые типы поверхностей. </p>
                <img
                    src="img/about/about-1.jpg"
                    style="width: 527px;"
                    class="align-left"
                    alt=""
                >
                <p>Оборудование для промышленной маркировки предназначено для нанесения идентификационных данных и
                    информации о
                    товаре в условиях производства. Современные каплеструйные принтеры позволяют наносить яркие стойкие
                    изображения
                    бесконтактным методом на любые типы поверхностей. </p>
                <p> Они легко встраиваются в технологический процесс, просты и удобны в эксплуатации. Альтернатива
                    каплеструйной
                    маркировке – <a href="">лазерная маркировка</a> изделий, позволяющая наносить долговременные, практически
                    нестираемые
                    изображения. Лазерный маркиратор не столь универсален в плане материала поверхности, зато более
                    экономичен и
                    гибок в настройке. Этикетка позволяет не только предоставляет покупателю информацию о товаре, но и
                    является
                    частью его рекламного образа. Любое серийное производство требует быстрого нанесения качественных
                    этикеток.
                    Для
                    решения этих задач мы поставляем автоматические аппликаторы самоклеящихся
                    этикеток и термотрансферные
                    принтеры.
                    В функции современных этикетировочных комплексов входит предварительная печать дополнительной
                    информации:
                    даты,
                    серии, штрих-кода.ктически нестираемые изображения. Лазерный маркиратор не столь универсален в плане
                    материала
                    поверхности, зато более экономичен и гибок в настройке. Этикетка позволяет не только предоставляет
                    покупателю
                    информацию о товаре, но и является частью его рекламного образа. Любое серийное производство требует
                    быстрого
                    нанесения качественных этикеток. Для решения этих задач мы поставляем автоматические аппликаторы
                    самоклеящихся
                    этикеток и термотрансферные принтеры. В функции </p>
                <img
                    src="img/content/img-2.jpg"
                    style="width: 336px;"
                    class="align-right"
                    alt=""
                >
                <p>Оборудование для промышленной маркировки предназначено для нанесения идентификационных данных и
                    информации о
                    товаре в условиях производства. Современные каплеструйные принтеры позволяют наносить яркие стойкие
                    изображения
                    бесконтактным методом на любые типы поверхностей.</p>
                <p>Они легко встраиваются в технологический процесс, просты и удобны в эксплуатации. Альтернатива
                    каплеструйной
                    маркировке – лазерная маркировка изделий, позволяющая наносить долговременные, практически
                    нестираемые
                    изображения. Лазерный маркиратор не столь универсален в плане материала поверхности, зато более
                    экономичен и
                    гибок в настройке. Этикетка позволяет не только предоставляет покупателю информацию о товаре, но и
                    является
                    частью его рекламного образа. Любое серийное производство требует быстрого нанесения качественных
                    этикеток.
                    Для
                    решения этих задач мы поставляем автоматические аппликаторы самоклеящихся
                    этикеток и термотрансферные
                    принтеры.
                    В функции современных этикетировочных комплексов входит предварительная печать дополнительной
                    информации:
                    даты,
                    серии, штрих-кода. Оборудование для промышленной маркировки предназначено для нанесения
                    идентификационных
                    данных
                    и информации о товаре в условиях производства. Современные каплеструйные принтеры позволяют наносить
                    яркие
                    стойкие изображения бесконтактным методом на любые типы поверхностей.</p>
                <p>Они легко встраиваются в технологический процесс, просты и удобны в эксплуатации. Альтернатива
                    каплеструйной
                    маркировке – лазерная маркировка изделий, позволяющая наносить долговременные, практически
                    нестираемые
                    изображения. Лазерный маркиратор не столь универсален в плане материала поверхности, зато более
                    экономичен и
                    гибок в настройке. Этикетка позволяет не только предоставляет покупателю информацию о товаре, но и
                    является
                    частью его рекламного образа. Любое серийное производство требует быстрого нанесения качественных
                    этикеток.
                    Для
                    решения этих задач мы поставляем автоматические аппликаторы самоклеящихся
                    этикеток и термотрансферные
                    принтеры.
                    В функции современных этикетировочных комплексов входит предварительная печать дополнительной
                    информации:
                    даты,
                    серии, штрих-кода.</p>
            </div>
            <LazySlidersGallery :slides="slides" />
        </div>
    </section>
</template>

<script setup>
const slides = [
    '/images/example-1.jpg',
    '/images/example-2.jpg',
    '/images/example-3.jpg',
    '/images/example-4.jpg',
    '/images/example-5.jpg'
]
const device = useDevice();

const table = ref(null);

onMounted(() => {
    if (device.isMobileOrTablet) {
        const tableWrap = document.createElement('div');
        tableWrap.classList.add('table-wrap');
        table.value.parentNode.insertBefore(tableWrap, table.value);
        tableWrap.appendChild(table.value);
    }
    console.log('hehe');
})
</script>

<style lang="scss">
@use "./assets/style/utils/mixin" as m;

.align-left {
    margin: 38px 40px 38px 0;
    float: left;
}

.align-right {
    margin: 30px 0 30px 40px;
    float: right;
}

.content-page {
    &__content {
        max-width: 1322px;
    }
}

.content {
    color: var(--text-secondary);

    h1,
    h2,
    h3,
    h4,
    h5,
    h6 {
        font-family: 'Onest', sans-serif;
        font-style: normal;
        font-weight: 400;
        color: var(--text-primary);
    }

    h1,
    h2 {
        margin-bottom: 40px;
    }

    h3,
    h4,
    h5,
    h6 {
        margin-bottom: 24px;
    }

    h1 {
        font-size: 78px;
        line-height: 100%;
    }

    h2 {
        font-size: 44px;
        line-height: 115%;
    }

    h3 {
        font-size: 32px;
        line-height: 110%;
    }

    h4 {
        font-size: 24px;
        line-height: 115%;
    }

    h5 {
        font-size: 20px;
        line-height: 110%;
    }

    *+h1,
    *+h2 {
        margin-top: 60px;
    }

    p+p,
    *+p,
    *+ul,
    *+ol,
    *+h3,
    *+h4,
    *+h5,
    *+h6 {
        margin-top: 24px;
    }

    ol,
    ul {
        display: flex;
        flex-direction: column;
        gap: 12px;
    }

    ol {
        counter-reset: num;
    }
    ol li {
        counter-increment: num;

        &::before {
            content: counter(num) ')';
            margin-right: 10px;
        }
    }

    ul li {
        position: relative;
        padding-left: 18px;

        &::before {
            content: '';
            position: absolute;
            left: 0;
            top: 7px;
            width: 8px;
            aspect-ratio: 1;
            background-color: var(--marker);
            border-radius: 50%;
        }
    }

    *+table {
        margin-top: 60px;
    }

    table {
        width: 100%;
        border-spacing: 0;
        border: 1px solid var(--stroke-primary);
        border-collapse: unset;
        border-radius: var(--br-s);
    }

    th,
    td {
        padding: 24px;
    }

    th {
        font-weight: 500;
        color: var(--text-primary);
        background-color: var(--bg-secondary);
        text-align: left;
    }

    th:first-child {
        border-radius: var(--br-s) 0 0 0;
    }

    th:last-child {
        border-radius: 0 var(--br-s) 0 0;
    }

    tr:not(:last-child) td {
        border-bottom: 1px solid var(--stroke-primary);
    }

    img {
        max-width: 100%;
        border-radius: var(--br-xs);
    }

    a {
        color: var(--btn-primary);
        text-decoration: underline;
        text-underline-offset: 1px;
        transition: color 0.3s ease;

        @include m.hover {
            &:hover {
                color: var(--btn-primary-hover);
            }
        }
    }
}

@include m.tablet {
    .content {
        h1,
        h2,
        h3,
        h4,
        h5,
        h6 {
            hyphens: auto;
        }

        h1 {
            font-size: 38px;
        }

        h2 {
            font-size: 26px;
        }

        h3 {
            font-size: 22px;
        }

        h4 {
            font-size: 20px;
        }

        h5 {
            font-size: 18px;
        }

        h1,
        h2 {
            margin-bottom: 24px;
        }

        *+h1,
        *+h2 {
            margin-top: 40px;
        }

        h3,
        h4,
        h5,
        h6 {
            margin-bottom: 18px;
        }

        p+p,
        *+p,
        *+ul,
        *+ol,
        *+h3,
        *+h4,
        *+h5,
        *+h6,
        *+.table-wrap {
            margin-top: 16px;
        }

        *+img {
            margin: 16px auto 0;
        }
        
        img {
            float: none;
        }
    }

    .table-wrap {
        overflow-x: auto;
        padding-right: 20px;
        margin-right: -20px;
    }
}
</style>